{
  "AK": {
    "id": "AK",
    "name": "Alaska",
    "classification": "unclear_or_local",
    "summary": "Alaska lacks comprehensive state-level e-scooter regulations, with most rules deferred to local ordinances. Third-party sources suggest a 20 MPH speed limit and helmet requirements for minors, but statutory authority remains ambiguous.",
    "minAge": null,
    "maxSpeedMph": null,
    "helmetRequired": "local_rule",
    "helmetNotes": "Some municipalities may require helmets for minors (e.g., under 18), but no statewide mandate exists per Alaska Statutes.",
    "licenseRequired": null,
    "registrationRequired": null,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Anchorage Municipal Code § 09.38.020 allows local authorities to regulate sidewalk use. Some cities permit riding with pedestrian yielding requirements.",
    "bikeLaneRiding": "unclear_or_silent",
    "streetRiding": "conditional",
    "streetNotes": "May operate on roads with speed limits ≤35 MPH where not explicitly prohibited by local law. Prohibited on highways.",
    "lightsRequired": null,
    "brakesRequired": null,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Conflicting sources suggest possible Class M2 license requirements for riders 14-15 operating <50cc equivalents, but statutory basis for e-scooter classification remains unclear. Low-Speed Vehicle (LSV) regulations in AS 28.90.990 don't apply to standard e-scooters.",
    "sourceLink": "https://www.akleg.gov/basis/Bill/Text/33?Hsid=HB0008A",
    "lastVerified": "2025-04-23"
  },
  "AL": {
    "id": "AL",
    "name": "Alabama",
    "classification": "specific_escooter",
    "summary": "Alabama defines 'Scooter' (<100 lbs, max 20 mph design) via SB312 (2019), primarily enabling local regulation of shared systems. Operational rules (age, speed, helmet, location) are set by cities/counties. No state license/registration required. Sidewalk riding often banned locally.",
    "minAge": null,
    "maxSpeedMph": 20,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide requirement. Local ordinances or shared system rules may require helmets.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "State law does not specify. Cities with shared programs (e.g., Birmingham, Montgomery) typically prohibit sidewalk riding.",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "local_rule",
    "streetNotes": "Allowed per local rules, typically on streets and bike paths where permitted.",
    "lightsRequired": "local_rule",
    "brakesRequired": "local_rule",
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "Alabama Act 2019-361 (SB312) defines 'Scooter' (<100 lbs, handlebars, electric motor, max 20 mph design) and 'Shared Micromobility Device System', requiring local consent for operation. Does not set statewide operational rules beyond the definition. Cities like Birmingham (age 19+) and Montgomery (age 18+) have specific rules for shared systems. Status of privately owned scooters varies and may be unclear locally.",
    "sourceLink": "https://codes.findlaw.com/al/title-32-motor-vehicles-and-traffic/al-code-sect-32-1-1-1.html",
    "lastVerified": "2025-04-24"
  },
  "AZ": {
    "id": "AZ",
    "name": "Arizona",
    "classification": "specific_escooter",
    "summary": "Arizona law treats electric standup scooters as bicycles, exempting them from registration, licensing, and insurance requirements. Local authorities may regulate usage on paths and sidewalks, with operation permitted on roads ≤25 MPH.",
    "minAge": null,
    "maxSpeedMph": 25,
    "helmetRequired": "none",
    "helmetNotes": "No statewide mandate, but local ordinances (e.g., Gilbert) may require helmets for minors.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "conditional",
    "sidewalkNotes": "Generally allowed unless prohibited locally. Riders must yield to pedestrians.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "conditional",
    "streetNotes": "Permitted on roads with speed limits ≤25 MPH. Prohibited on highways.",
    "lightsRequired": null,
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": null,
    "maxWeightLbs": 75,
    "generalNotes": "Defined as ≤75 lbs with handlebars and standing platform (ARS §28-819). Local authorities may restrict path usage. Scooters must display unique identification visible from 5 feet.",
    "sourceLink": "https://www.azleg.gov/ars/28/00819.htm",
    "lastVerified": "2025-04-23"
  },
  "AR": {
    "id": "AR",
    "name": "Arkansas",
    "classification": "specific_escooter",
    "summary": "Arkansas law defines and regulates electric motorized scooters, setting a minimum rider age of 16, a 15 MPH maximum speed, and generally prohibits sidewalk riding. Local governments may impose additional rules, but there is no statewide helmet, license, or registration requirement.",
    "minAge": 16,
    "maxSpeedMph": 15,
    "helmetRequired": "none",
    "helmetNotes": "No statewide helmet requirement, but local ordinances may impose helmet rules.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "prohibited",
    "sidewalkNotes": "Riding on sidewalks is generally prohibited statewide; local authorities may regulate further.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Scooters must be operated on the road and riders must obey all traffic regulations.",
    "lightsRequired": null,
    "brakesRequired": null,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "Electric motorized scooters are defined as devices with a weight under 100 lbs, two or three wheels, a handlebar, a floorboard for standing, and propelled by an electric motor. Local authorities retain the power to regulate additional aspects of scooter use.",
    "sourceLink": "https://law.justia.com/codes/arkansas/title-27/subtitle-4/chapter-51/subchapter-19/",
    "lastVerified": "2025-04-23"
  },
  "CA": {
    "id": "CA",
    "name": "California",
    "classification": "specific_escooter",
    "summary": "California law defines 'motorized scooters', requires a driver's license/permit, mandates helmets for riders under 18, sets a 15 MPH speed limit, prohibits sidewalk riding, and requires use of bike lanes when available. DUI laws apply.",
    "minAge": 16,
    "maxSpeedMph": 15,
    "helmetRequired": "under_18",
    "helmetNotes": "Helmet must be properly fitted and fastened, meeting standards of CVC §21212. Not required for adults 18+.",
    "licenseRequired": true,
    "registrationRequired": false,
    "sidewalkRiding": "prohibited",
    "sidewalkNotes": "Prohibited except as necessary to enter or leave adjacent property. Riding in crosswalks is also prohibited as they are considered sidewalks per CVC §275.",
    "bikeLaneRiding": "required_if_available",
    "streetRiding": "conditional",
    "streetNotes": "Permitted on streets with speed limits of 25 MPH or less. Operation on streets with speed limits up to 35 MPH is allowed only within a Class II or Class IV bikeway, unless a local ordinance specifically authorizes operation outside a bikeway on such streets. Max scooter speed remains 15 MPH (CVC §22411).",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": 750,
    "maxWeightLbs": null,
    "generalNotes": "Device defined as 'motorized scooter' with handlebars and floorboard. No passengers allowed (CVC §21235(e)). Must keep at least one hand on handlebars (CVC §21235(f)). Specific procedure for left turns: stop, dismount, walk across (CVC §21228). Must not be parked blocking pedestrian path (CVC §21235(i)). Operator subject to same rights/responsibilities as motor vehicle drivers where applicable (CVC §21221).",
    "sourceLink": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=VEH&sectionNum=21235.",
    "lastVerified": "2025-04-23"
  },
  "CO": {
    "id": "CO",
    "name": "Colorado",
    "classification": "specific_escooter",
    "summary": "Colorado law defines electric scooters separately, grants them the same rights and duties as riders of electrical assisted bicycles, exempts them from registration and licensing, and allows local governments to regulate their use similarly to bicycles. Scooters may operate on roads, bike lanes, and most paths unless locally restricted.",
    "minAge": null,
    "maxSpeedMph": 20,
    "helmetRequired": "none",
    "helmetNotes": "No statewide helmet requirement for e-scooters; helmet rules for Class 3 e-bikes do not apply to scooters.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "allowed",
    "sidewalkNotes": "Permitted unless restricted by local ordinance. Local governments may prohibit sidewalk riding.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Scooters are permitted on roadways and have the same rights and duties as bicycles and electrical assisted bicycles.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": 750,
    "maxWeightLbs": 100,
    "generalNotes": "Electric scooters are defined as devices under 100 lbs, with handlebars and an electric motor, and a max speed of 20 mph on level ground. Local regulation cannot be more restrictive than for Class 1 e-bikes. Scooters must have an identifying number stamped or cast on the frame. Visibility equipment including front lamp, red rear reflector, and side reflective material is required. Brakes must be capable of stopping the scooter within 25 feet from a speed of 10 mph. Sirens and whistles are not permitted.",
    "sourceLink": "https://leg.colorado.gov/bills/hb19-1221",
    "lastVerified": "2025-04-23"
  },
  "CT": {
    "id": "CT",
    "name": "Connecticut",
    "classification": "specific_escooter",
    "summary": "Connecticut law defines 'electric foot scooters' and treats them similarly to bicycles and e-bikes. Riders have the same rights, privileges, and responsibilities as bicyclists on the road, with no state-level age restrictions or licensing requirements.",
    "minAge": null,
    "maxSpeedMph": 20,
    "helmetRequired": "under_16",
    "helmetNotes": "Mandatory for riders under 15 years old. Helmets must meet ANSI or Snell Memorial Foundation safety standards. Scooter-sharing companies must offer compliant helmets to clients under 16.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "allowed",
    "sidewalkNotes": "Permitted on sidewalks with requirement to yield to pedestrians.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Allowed on roads, city streets, and bicycle lanes as per bicycle regulations.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": 75,
    "generalNotes": "Electric scooters ('electric foot scooters') share regulations with bicycles and e-bikes. Must be equipped with a reliable braking system, front white headlight, and rear reflector or tail light, plus reflective material on the sides. Sirens and whistles are prohibited. Exempt from motor vehicle registration and insurance requirements.",
    "sourceLink": "https://www.cga.ct.gov/current/pub/chap_246.htm",
    "lastVerified": "2025-04-23"
  },
  "DC": {
    "id": "DC",
    "name": "District of Columbia",
    "classification": "specific_escooter",
    "summary": "D.C. law defines electric scooters (primarily as 'Electric Mobility Devices' - EMDs, <75 lbs, max 20 mph design) and regulates them separately. Minimum rider age is 16, max operational speed is 10 mph, and helmets are required for riders under 16. Permitted in bike lanes and on low-speed roads, but prohibited on sidewalks in the Central Business District and certain National Mall areas. No license or registration required. Shared scooters must be locked to infrastructure.",
    "minAge": 16,
    "maxSpeedMph": 10,
    "helmetRequired": "under_16",
    "helmetNotes": "Required for riders under 16. Fine for non-compliance is $25, potentially waived with proof of helmet purchase.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "conditional",
    "sidewalkNotes": "Prohibited in the Central Business District (CBD) and designated National Mall zones. Permitted elsewhere, but riders must yield to pedestrians. Fines apply for violations.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Permitted on streets; riders subject to vehicle traffic laws. Must operate at ≤10 mph. Riding to the far right is advisable due to low speed limit.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": null,
    "maxWeightLbs": 75,
    "generalNotes": "Classified as 'Electric Mobility Device' (EMD: <75 lbs, ≤24\" wide, ≤55\" long, electric motor) or 'Personal Mobility Device' (PMD: ≥75 lbs or self-balancing). EMD max design speed 20 mph (per other sources, though code doesn't specify speed in EMD def). No passengers allowed. Cannot carry items preventing two-handed operation. No headsets/earphones (except hearing aids/single ear). Shared scooters must be locked upright to approved infrastructure (bike racks, signposts etc.), not blocking access. Must have a bell.",
    "sourceLink": "https://code.dccouncil.gov/us/dc/council/code/sections/50-2201.02",
    "lastVerified": "2025-04-24"
  },
  "DE": {
    "id": "DE",
    "name": "Delaware",
    "classification": "prohibited",
    "summary": "Delaware has restrictive regulations for electric scooters, categorizing them alongside 'motorized skateboards' with significant restrictions on their use in public spaces. Use on public highways, streets, and sidewalks is generally prohibited.",
    "minAge": 12,
    "maxSpeedMph": null,
    "helmetRequired": "under_16",
    "helmetNotes": "Riders and passengers under 16 must wear bicycle-type helmets meeting ANSI or Snell standards.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "prohibited",
    "sidewalkNotes": "Use on public sidewalks is banned.",
    "bikeLaneRiding": "prohibited",
    "streetRiding": "prohibited",
    "streetNotes": "Use on public highways and streets is banned except during approved special events or when the powertrain is disengaged.",
    "lightsRequired": null,
    "brakesRequired": null,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Riders under 12 must be supervised by an adult (18+) unless on property owned by their parent/guardian. Delaware requires sellers to obtain signed acknowledgment from purchasers regarding restrictions on public use. Non-compliance can result in fines starting at $25 for first offense. Electric scooters cannot be registered or insured, further limiting their use on public roadways.",
    "sourceLink": "https://delcode.delaware.gov/title21/c001/index.html",
    "lastVerified": "2025-04-23"
  },
  "FL": {
    "id": "FL",
    "name": "Florida",
    "classification": "specific_escooter",
    "summary": "Florida law defines motorized scooters and treats riders similar to bicyclists. No license, registration, or insurance is required statewide, but local governments retain authority to regulate where scooters can operate and how they can be parked.",
    "minAge": null,
    "maxSpeedMph": 20,
    "helmetRequired": "under_16",
    "helmetNotes": "Helmets must meet the standards of the American National Standards Institute (ANSI Z Bicycle Helmet Standards) or the Snell Memorial Foundation.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "conditional",
    "sidewalkNotes": "Generally prohibited statewide to protect pedestrians, but local ordinances may allow sidewalk riding. When permitted, riders must yield to pedestrians.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "conditional",
    "streetNotes": "Allowed on streets with speed limits of 35 mph or less, but prohibited on highways. E-scooter riders have 'all rights and duties applicable to the rider of a bicycle' regarding road use.",
    "lightsRequired": null,
    "brakesRequired": null,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Motorized scooters are defined as vehicles not having a seat or saddle for the rider, with not more than three wheels, and a maximum speed of 20 mph on level ground. Florida Statute § 316.2128 establishes that e-scooter riders have most of the same rights and duties as bicycle riders, with exceptions for rules that by their nature don't apply. E-scooter rental companies are responsible for securing scooters during hurricane warnings.",
    "sourceLink": "http://www.leg.state.fl.us/Statutes/index.cfm?App_mode=Display_Statute&URL=0300-0399/0316/Sections/0316.2128.html",
    "lastVerified": "2025-04-23"
  },
  "GA": {
    "id": "GA",
    "name": "Georgia",
    "classification": "local_rule",
    "summary": "Georgia has established a basic legal framework for electric scooters but delegates most regulatory authority to local jurisdictions. State law defines scooters and permits local governments to establish their own regulations regarding operation and insurance requirements.",
    "minAge": null,
    "maxSpeedMph": 20,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide helmet requirements. Local jurisdictions may establish their own helmet regulations.",
    "licenseRequired": null,
    "registrationRequired": null,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "State law defers to local jurisdictions regarding where electric scooters may be operated.",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "local_rule",
    "streetNotes": "Local authorities have the power to regulate electric scooter operation on highways under their jurisdiction.",
    "lightsRequired": null,
    "brakesRequired": null,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "Georgia law (SB 159) defines electric scooters as devices weighing less than 100 pounds, equipped with handlebars and an electric motor, capable of a maximum speed of 20 mph. The state explicitly excludes electric scooters from the definition of 'motor vehicle' and grants local authorities broad powers to regulate their operation, including insurance requirements.",
    "sourceLink": "https://www.legis.ga.gov/api/legislation/document/20192020/189446",
    "lastVerified": "2025-04-23"
  },
  "HI": {
    "id": "HI",
    "name": "Hawaii",
    "classification": "specific_escooter",
    "summary": "Hawaii law defines 'electric foot scooters' with specific regulations including minimum age requirements, helmet requirements for younger riders, and registration requirements. Electric scooters are granted the same rights and duties as vehicles, with certain exceptions.",
    "minAge": 15,
    "maxSpeedMph": 15,
    "helmetRequired": "under_16",
    "helmetNotes": "Riders under 16 must wear a bicycle helmet. Rental companies must provide helmets to renters under 15.",
    "licenseRequired": false,
    "registrationRequired": true,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Counties are authorized to regulate electric foot scooter operations on sidewalks.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Electric foot scooters are granted all rights and subject to all duties applicable to vehicle drivers when operated on highways, roadways, or other designated public areas.",
    "lightsRequired": "night",
    "brakesRequired": null,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": 50,
    "generalNotes": "Electric foot scooters must be registered with a one-time $30 fee. No person shall carry passengers on an electric scooter, and riders may not carry items that prevent using both hands to operate the scooter. Scooters must have front and rear lights for night use. Operators must not exceed 15 mph or operate at speeds that are not reasonable and prudent under existing conditions. Counties may establish additional regulations for scooter operations.",
    "sourceLink": "https://www.capitol.hawaii.gov/sessions/session2021/bills/HB147_.HTM",
    "lastVerified": "2025-04-23"
  },
  "ID": {
    "id": "ID",
    "name": "Idaho",
    "classification": "local_rule",
    "summary": "Idaho state law has limited specific regulations for electric scooters, with most regulations being established at the local level. In Idaho Falls, for example, detailed regulations exist defining e-scooters and their operation, treating them similarly to bicycles with specific rules for where and how they can be used.",
    "minAge": null,
    "maxSpeedMph": 20,
    "helmetRequired": "none",
    "helmetNotes": "No statewide helmet requirement; local jurisdictions may establish their own requirements.",
    "licenseRequired": false,
    "registrationRequired": "local_rule",
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Varies by locality. In Idaho Falls, e-scooters may be operated on sidewalks except in the Central Downtown Area, and must yield to pedestrians.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "In Idaho Falls, e-scooters are permitted on roadways and must follow traffic laws. Operators must not ride against the flow of traffic.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Idaho grants local authorities significant control over e-scooter regulations. In Idaho Falls, e-scooters are defined as devices with handlebars, a floorboard, and an electric motor not exceeding 20 mph. They must have brakes capable of stopping within 25 feet at 10 mph, an audible warning device, and lights for nighttime use. Operators must keep at least one hand on the handlebars at all times. Dockless e-scooter programs require a business license, and scooters must be registered with the city.",
    "sourceLink": "https://www.idahofallsidaho.gov/DocumentCenter/View/11049/Chapter-8---E-Bikes-and-E-Scooters-PDF",
    "lastVerified": "2025-04-23"
  },
  "RI": {
    "id": "RI",
    "name": "Rhode Island",
    "classification": "local_rule",
    "summary": "Rhode Island has minimal statewide e-scooter regulation, primarily requiring helmets for riders 15 and under (RIGL § 31-19-2.1). Most rules are determined by local municipalities, often through pilot programs (e.g., Providence, Pawtucket). Local ordinances vary regarding age limits, sidewalk use, and other operational aspects.",
    "minAge": null,
    "maxSpeedMph": null,
    "helmetRequired": "under_16",
    "helmetNotes": "Mandatory for operators and passengers aged 15 years or younger when operated on public roads, paths, or trails, per RIGL § 31-19-2.1 (applicable via bicycle definitions). Local programs often encourage helmets for all.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Determined by local ordinance. Providence permits sidewalk riding (program rules), while Pawtucket prohibits it.",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "local_rule",
    "streetNotes": "Permitted based on local ordinances. Follow local traffic laws.",
    "lightsRequired": "local_rule",
    "brakesRequired": "local_rule",
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "State law primarily addresses helmet use for minors (<16) via bicycle regulations (RIGL § 31-19-2.1). Specific e-scooter operation rules are largely governed by city/town ordinances and pilot programs. Examples: Providence requires riders in its program to be 18+ and allows sidewalk riding; Pawtucket also sets age 18+ for its program but prohibits sidewalk riding. Newport is also developing local regulations.",
    "sourceLink": "https://law.justia.com/codes/rhode-island/title-31/chapter-31-19/",
    "lastVerified": "2025-04-24"
  },
  "SC": {
    "id": "SC",
    "name": "South Carolina",
    "classification": "local_rule",
    "summary": "South Carolina lacks specific statewide legislation for electric scooters, leaving regulation entirely to individual cities and towns. Local ordinances vary significantly, with some cities banning shared scooter rentals (Charleston, Myrtle Beach) or scooter use in specific areas (Greenville CBD, Hilton Head pathways). Rules for private scooters also depend on local laws.",
    "minAge": null,
    "maxSpeedMph": null,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide helmet requirement. Local ordinances may mandate helmets (e.g., Columbia requires them).",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Determined by local ordinances. Prohibited in Charleston and Columbia.",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "local_rule",
    "streetNotes": "Rules vary significantly by city. Charleston allows on roads < 25 mph. Columbia prohibits on roads >= 25 mph.",
    "lightsRequired": "local_rule",
    "brakesRequired": "local_rule",
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "South Carolina has no statewide definition or specific regulation for electric scooters. All rules are established at the local level. Examples: Charleston prohibits rentals and sidewalk riding, allows operation < 15 mph on roads < 25 mph. Myrtle Beach bans shared devices on public property. Greenville bans e-scooters in the central business district. Columbia bans sidewalk riding, use on roads >= 25 mph, and requires helmets. Hilton Head Island bans e-scooters on public pathways. Check local city/town ordinances for specific rules.",
    "sourceLink": null,
    "lastVerified": "2025-04-24"
  },
  "SD": {
    "id": "SD",
    "name": "South Dakota",
    "classification": "specific_escooter",
    "summary": "South Dakota defines 'motorized foot scooters' (SDCL 32-26-21.4) with a max speed of 15 mph and <=12-inch wheels. No statewide age, license, helmet, registration, or insurance requirements exist. Scooters are allowed on roadways, paths, and sidewalks, but local governments can impose further restrictions.",
    "minAge": null,
    "maxSpeedMph": 15,
    "helmetRequired": "none",
    "helmetNotes": "No statewide helmet requirement exists.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "allowed",
    "sidewalkNotes": "Permitted statewide, but local jurisdictions have the authority to impose additional restrictions.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Permitted on roadways. Subject to general traffic rules.",
    "lightsRequired": "local_rule",
    "brakesRequired": "local_rule",
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Defined as 'motorized foot scooter' in SDCL 32-26-21.4: handlebars, stand/sit design, electric motor, max speed 15 mph, <= 2 wheels of <=12-inch diameter. HB 1084 (2021) established these rules. Exempt from registration and insurance. No state age or license requirements specified. Helmets not mandated statewide. Allowed on roadways, bicycle paths, multi-use paths, and sidewalks, but local authorities can regulate usage further. Equipment requirements like lights/brakes depend on local rules or application of general bicycle laws (not explicitly stated).",
    "sourceLink": "https://sdlegislature.gov/Statutes/32-26-21.4",
    "lastVerified": "2025-04-24"
  },
  "TN": {
    "id": "TN",
    "name": "Tennessee",
    "classification": "specific_escooter",
    "summary": "Tennessee defines 'electric foot scooters' (<100 lbs, max 20 mph design) and regulates them like bicycles (TCA § 55-8-301 et seq.). Minimum age is 16, max operational speed is 15 mph, helmets required under 16. No license, registration, or insurance needed. Allowed on roads/paths where bikes go; sidewalk use depends on local rules.",
    "minAge": 16,
    "maxSpeedMph": 15,
    "helmetRequired": "under_16",
    "helmetNotes": "Required for operators under 16 years old, per bicycle helmet laws (TCA § 55-52-105) applied via TCA § 55-8-171/172.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Prohibited unless specifically authorized by local government resolution or ordinance (TCA § 55-8-306(a)(4)). Parking permitted if not impeding traffic (TCA § 55-8-306(c)).",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Permitted on streets/highways where bicycles are allowed (TCA § 55-8-306). Max operational speed 15 mph (TCA § 55-8-306(d)). Must ride as far right as practicable (TCA § 55-8-175).",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "Defined as 'Electric foot scooter' in TCA § 55-8-301 (<100 lbs, max 20 mph design speed). Regulated under TCA Title 55, Ch 8, Part 3, applying bicycle rights/duties (TCA § 55-8-172, 55-8-302). Minimum age 16 (implied via TCA § 55-8-306(d)). Max operational speed 15 mph (TCA § 55-8-306(d)). Exempt from registration, license, insurance (TCA § 55-8-302). Requires front white light & rear red light/reflector at night (TCA § 55-8-177(a)), and brakes (TCA § 55-8-177(b)). DUI laws apply (TCA § 55-10-401 applies to vehicles, scooters subject to driver duties TCA § 55-8-172). Local governments can add restrictions.",
    "sourceLink": "https://law.justia.com/codes/tennessee/2021/title-55/chapter-8/part-3/",
    "lastVerified": "2025-04-24"
  },
  "UT": {
    "id": "UT",
    "name": "Utah",
    "classification": "specific_escooter",
    "summary": "Utah defines electric scooters as 'motor-assisted scooters' (Utah Code 41-6a-102), limited to 15 mph operation (20 mph design, 2000W max). Minimum age is 8 (with supervision) or 16 (independent). Helmets required under 21. Subject to bicycle rules, allowed on roads <= 25 mph and bike lanes. Sidewalk use depends on local rules. No license/registration.",
    "minAge": 8,
    "maxSpeedMph": 15,
    "helmetRequired": "under_21",
    "helmetNotes": "Protective headgear required for operators under 21 years old when operated on any highway (41-6a-1116(7)).",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Permitted only if not prohibited by local ordinance (41-6a-1116(5)).",
    "bikeLaneRiding": "allowed",
    "streetRiding": "conditional",
    "streetNotes": "Permitted on roadways with speed limits of 25 mph or less. Prohibited on roadways with speed limits > 25 mph and on highways with 4+ lanes (41-6a-1116(4)).",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": 2000,
    "maxWeightLbs": null,
    "generalNotes": "Defined as 'Motor assisted scooter' (41-6a-102(44)) with max design speed 20 mph and motor <= 2000W. Regulated under 41-6a-1116. Min age 16 for independent operation; age 8-15 allowed only with direct supervision from parent/guardian (18+); under 8 prohibited. Max operational speed 15 mph. Treated like bicycles regarding rights/duties (41-6a-1114). Helmets required < 21 on highways. Exempt from license/registration/insurance. Requires brakes (per definition). Lights required sunset-sunrise (per applied bicycle rules 41-6a-1113). Prohibited in public parking structures and where skateboards are banned. Local authorities can regulate further.",
    "sourceLink": "https://le.utah.gov/xcode/Title41/Chapter6A/41-6a-S102.html",
    "lastVerified": "2025-04-24"
  },
  "VT": {
    "id": "VT",
    "name": "Vermont",
    "classification": "local_rule",
    "summary": "Vermont lacks specific statewide laws for electric scooters. Regulation is handled by individual cities and towns, leading to varied rules. Burlington, for example, allows shared scooters on roads (max 15 mph) but not sidewalks, requiring users to be 18+. No general state rules on age, helmets, or operation exist.",
    "minAge": null,
    "maxSpeedMph": null,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide helmet requirement for electric scooters. Local ordinances or specific programs (like Burlington's) may have their own rules.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Determined by local ordinance. Burlington prohibits sidewalk riding for its scooter share program.",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "local_rule",
    "streetNotes": "Determined by local ordinance. Burlington allows roadway use for its program, generally limited to 15 mph.",
    "lightsRequired": "local_rule",
    "brakesRequired": "local_rule",
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Vermont state law does not specifically define or regulate electric scooters. The provided statute (23 V.S.A. § 1136a) applies to electric bicycles, not scooters. E-scooter regulations are established at the municipal level. Burlington's pilot program serves as an example, requiring riders to be 18+ and restricting speed to 15 mph, allowing road use but prohibiting sidewalk use. Rules in other towns may differ or be nonexistent.",
    "sourceLink": "https://legislature.vermont.gov/statutes/section/23/013/01136a",
    "lastVerified": "2025-04-24"
  },
  "VA": {
    "id": "VA",
    "name": "Virginia",
    "classification": "specific_escooter",
    "summary": "Virginia defines electric scooters as 'Motorized skateboards or scooters' (<100 lbs, max 20 mph), requires riders to be 14+, exempts them from registration/license, and generally treats them like bicycles regarding road use. Sidewalk riding requires local authorization. Helmets are not mandated statewide.",
    "minAge": 14,
    "maxSpeedMph": 20,
    "helmetRequired": "none",
    "helmetNotes": "No statewide mandate.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Prohibited statewide unless explicitly authorized by local ordinance or on designated shared-use paths (§ 46.2-908.1). Must yield to pedestrians where permitted.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Permitted on highways where bicycles are allowed. Operators subject to rules of the road applicable to vehicles (§ 46.2-800). Prohibited on interstates.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "Defined as 'Motorized skateboard or scooter' (§ 46.2-100), weighing less than 100 lbs with max speed 20 mph. Minimum age 14; riders under 14 require direct supervision by person 18+ (§ 46.2-908.1). No VIN required. Lights required at night (§ 46.2-1015). Subject to bicycle/vehicle rules on highways (§ 46.2-800), implying brake requirement and DUI applicability. Localities can regulate further.",
    "sourceLink": "https://law.lis.virginia.gov/vacode/title46.2/chapter1/section46.2-100/",
    "lastVerified": "2025-04-24"
  },
  "WA": {
    "id": "WA",
    "name": "Washington",
    "classification": "specific_escooter",
    "summary": "Washington defines electric scooters as 'Motorized foot scooters' (RCW 46.04.336), treats them similarly to bicycles, requires riders to be 16+, limits operational speed to 15 mph (design max 20 mph), encourages helmets, and exempts them from license/registration. Allowed on roads, paths, and bike lanes; prohibited on sidewalks and limited-access highways.",
    "minAge": 16,
    "maxSpeedMph": 15,
    "helmetRequired": "none",
    "helmetNotes": "State law encourages but does not mandate helmet use.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "prohibited",
    "sidewalkNotes": "Prohibited by state law.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Allowed on roads, shared-use paths, and bicycle lanes. Prohibited on fully controlled limited-access highways.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Defined as 'Motorized foot scooter' (RCW 46.04.336) with max design speed 20 mph. Max operational speed limited to 15 mph. Regulated similarly to bicycles. Must be equipped with reflectors. Exempt from registration/insurance. Local regulations may apply.",
    "sourceLink": "https://app.leg.wa.gov/rcw/default.aspx?cite=46.04.336",
    "lastVerified": "2025-04-24"
  },
  "IL": {
    "id": "IL",
    "name": "Illinois",
    "classification": "specific_escooter",
    "summary": "Illinois law defines low-speed electric scooters (≤100 lbs, ≤10 MPH) and exempts them from licensing and registration, but only allows their use where authorized by local governments. Riders must be at least 18, sidewalk riding is locally regulated, and there is no statewide helmet requirement.",
    "minAge": 18,
    "maxSpeedMph": 10,
    "helmetRequired": "none",
    "helmetNotes": "No statewide helmet law; some municipalities (e.g., Chicago) require helmets for rental scooter users.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Sidewalk riding is regulated by local governments; some cities prohibit it, others allow with restrictions.",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "conditional",
    "streetNotes": "Permitted only on roads with speed limits ≤35 MPH and only where local governments have authorized scooter use. Prohibited on state highways.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "Low-speed electric scooters must have 2 or 3 wheels, handlebars, a floorboard, and be powered by electric motor and/or human power. Only one rider per scooter. Local governments may impose additional rules and must specifically authorize operation. Scooters must be maintained in good condition and equipped with lamps, brakes, and a warning device.",
    "sourceLink": "https://www.ilga.gov/legislation/publicacts/fulltext.asp?name=103-0899&GA=103&SessionId=112&DocTypeId=SB&DocNum=1960&GAID=17&SpecSess=&Session=",
    "lastVerified": "2025-05-14"
  },
  "IN": {
    "id": "IN",
    "name": "Indiana",
    "classification": "specific_escooter",
    "summary": "Indiana defines 'electric foot scooters' and grants them the same rights and responsibilities as bicycles. No age, license, registration, or insurance requirements exist statewide. Scooters are limited to 100 lbs weight and 20 mph maximum speed, and sidewalk riding is prohibited except when parking.",
    "minAge": null,
    "maxSpeedMph": 20,
    "helmetRequired": "none",
    "helmetNotes": "No statewide helmet requirement, though helmet use is strongly encouraged, especially for shared mobility devices.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "prohibited",
    "sidewalkNotes": "Not permitted on sidewalks except when entering or leaving a parked position. Parking on sidewalks is allowed if it doesn't impede pedestrian movement.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Can be ridden anywhere bicycles are allowed. Local authorities may impose additional restrictions. Prohibited on interstate highways.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "Electric foot scooters must be equipped with a white front light, a red rear light or reflector, and a reliable braking system for night operation. Sirens and whistles are not permitted. Local authorities may prohibit sidewalk parking if adequate alternative parking is provided nearby. Scooters have the same rights and duties as bicycles except where by their nature these have no application.",
    "sourceLink": "https://iga.in.gov/laws/2019/ic/titles/9#9-13-2-49.4",
    "lastVerified": "2025-04-24"
  },
  "IA": {
    "id": "IA",
    "name": "Iowa",
    "classification": "unclear_or_local",
    "summary": "Iowa has no statewide laws specifically governing electric scooters, despite legislative consideration through House Bill 500. Regulation is left to local municipalities, with most cities adopting guidelines aligned with bicycle laws and imposing age minimums, speed limits, and location restrictions.",
    "minAge": null,
    "maxSpeedMph": null,
    "helmetRequired": "local_rule",
    "helmetNotes": "Helmet requirements vary by local ordinance with no statewide mandate.",
    "licenseRequired": null,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Permissions for sidewalk riding vary by city, with some municipalities permitting it and others restricting it in certain areas like business districts.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "conditional",
    "streetNotes": "Most municipalities permit riding on streets with speed limits of 25-35 mph or less. Some cities require use of bike lanes when available.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "Although House File 500 was introduced to regulate electric scooters at the state level (defining them as devices under 100 pounds with handlebars and electric motors capable of 20 mph max speed), the bill did not pass. Currently, cities establish their own regulations, typically requiring riders to be at least 18 years old and equipping scooters with proper lighting, reflectors, and brakes. Electric scooters are generally exempt from motor vehicle registration, insurance, and inspection requirements.",
    "sourceLink": "https://www.legis.iowa.gov/legislation/BillBook?ga=88&ba=HF500",
    "lastVerified": "2025-04-23"
  },
  "KS": {
    "id": "KS",
    "name": "Kansas",
    "classification": "specific_escooter",
    "summary": "Kansas defines 'electric-assisted scooters' in state law and exempts them from vehicle registration requirements. The state establishes basic parameters but delegates specific regulations like age requirements, speed limits, and helmet mandates to local jurisdictions.",
    "minAge": null,
    "maxSpeedMph": null,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide helmet requirement; some municipalities (e.g., Topeka) require helmets for riders under 18.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Regulations for sidewalk riding vary by municipality.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "conditional",
    "streetNotes": "Generally allowed on roadways at the state level. Some local ordinances (e.g., Topeka) prohibit use on roads with speed limits above 35 mph unless there's a designated bike lane.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Kansas officially defines electric-assisted scooters as self-propelled vehicles with at least two wheels, an electric motor, handlebars, brakes, and a deck designed to be stood upon when riding. They are explicitly exempt from vehicle registration requirements under state law (K.S.A. 8-128). Scooters must have a white front lamp and a rear red light or reflector for night operation. The state allows local municipalities to establish their own specific regulations, such as Topeka's 15 mph speed limit and minimum operator age of 16 years.",
    "sourceLink": "https://www.kslegislature.gov/li_2024/b2023_24/statute/008_000_0000_chapter/008_014_0000_article/008_014_0098_section/008_014_0098_k/",
    "lastVerified": "2025-04-23"
  },
  "KY": {
    "id": "KY",
    "name": "Kentucky",
    "classification": "specific_escooter",
    "summary": "Kentucky law defines 'electric low-speed scooters' and permits their operation by riders at least 16 years old. Scooters must weigh under 100 lbs with a maximum speed of 20 mph. They're allowed on highways, bicycle lanes, and paths, subject to traffic regulations, but most cities prohibit sidewalk riding.",
    "minAge": 16,
    "maxSpeedMph": 20,
    "helmetRequired": "none",
    "helmetNotes": "No statewide helmet requirement. Administrative regulations are specifically prohibited from including helmet mandates (KRS 189.289).",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "prohibited",
    "sidewalkNotes": "Most cities prohibit riding on sidewalks, though parking on sidewalks is permitted if it doesn't impede pedestrian movement.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Permitted on highways, bicycle lanes, paths, shared streets, and shared-use paths.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "Electric low-speed scooters must have at least one headlamp and one rear red light for operation from sunset to sunrise or in low visibility conditions. Operators are subject to standard traffic regulations and DUI laws (KRS 189.520). Local government ordinances may impose additional requirements, which operators and rental companies must comply with. The Transportation Cabinet is authorized to establish safe operating standards, but is prohibited from including equipment or helmet use requirements.",
    "sourceLink": "https://apps.legislature.ky.gov/law/statutes/statute.aspx?id=48629",
    "lastVerified": "2025-04-23"
},
"LA": {
    "id": "LA",
    "name": "Louisiana",
    "classification": "specific_escooter",
    "summary": "Louisiana defines 'electric low-speed scooters' and permits their operation on sidewalks, bicycle paths, and highways unless limited by local authorities. Riders under 17 must wear helmets. Scooters must weigh less than 100 lbs, have a maximum speed of 20 mph, and be equipped with brakes and appropriate lighting.",
    "minAge": null,
    "maxSpeedMph": 20,
    "helmetRequired": "under_16",
    "helmetNotes": "Riders under 17 years of age must wear an approved helmet as specified in state law (R.S. 32:199).",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "allowed",
    "sidewalkNotes": "Generally permitted, though local authorities may limit or prohibit operation on sidewalks under their jurisdiction for safety reasons.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Permitted on highways with requirement to ride as near to the right side as practicable, with exceptions for turning, passing, or avoiding hazards.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "Electric low-speed scooters are defined as rental or commercial scooters with handlebars and an electric motor, powered solely by an electric motor or human power. They are explicitly not considered motor-driven cycles, vehicles, or motor vehicles. Operators are granted the same rights and duties as vehicle drivers with certain exceptions. No operator may carry passengers beyond the scooter's design capacity, attach to other vehicles, or carry items that prevent keeping at least one hand on the handlebars. Motor vehicles must maintain a safe passing distance of at least three feet when overtaking scooters.",
    "sourceLink": "https://legis.la.gov/Legis/law.aspx?d=1148278",
    "lastVerified": "2025-04-23"
  },
  "ME": {
    "id": "ME",
    "name": "Maine",
    "classification": "specific_escooter",
    "summary": "Maine classifies devices as 'motorized scooters' and regulates them similarly to bicycles. Riders must possess a valid license, learner's permit, or motorcycle/moped endorsement (effectively setting minimum age at 16), and helmets are mandatory for those under 16.",
    "minAge": 16,
    "maxSpeedMph": 20,
    "helmetRequired": "under_16",
    "helmetNotes": "Helmets are mandatory for riders and passengers under 16 years of age when operating on public roadways.",
    "licenseRequired": true,
    "registrationRequired": false,
    "sidewalkRiding": null,
    "sidewalkNotes": "State law does not explicitly address sidewalk riding for motorized scooters, though local ordinances may impose restrictions.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Permitted on roadways (riding as far right as practicable), paved shoulders, and designated bicycle or multi-use paths. Prohibited on interstate highways or paths where bicycles are not allowed.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": null,
    "maxPowerWatts": 750,
    "maxWeightLbs": null,
    "generalNotes": "Maine defines 'motorized scooter' as a scooter with 2 or 3 wheels less than 10 inches in diameter in ground contact, powered by a motor with capacity not exceeding 750 watts. Must be equipped with a white front lamp, a rear red or amber light or reflector. Riders must follow the same traffic rules as bicyclists.",
    "sourceLink": "https://legislature.maine.gov/statutes/29-A/title29-Asec101.html",
    "lastVerified": "2025-04-23"
  },
  "MD": {
    "id": "MD",
    "name": "Maryland",
    "classification": "specific_escooter",
    "summary": "Maryland formally recognized electric scooters in 2019 (SB770), defining them as 'electric low speed scooters' and regulating them similarly to bicycles and e-bikes. They're limited to 100 lbs weight and 20 mph speed, with no license or registration required. Riders under 16 must wear helmets, and scooters are allowed on roads, bike lanes, and shoulders with speed limits under 50 mph.",
    "minAge": null,
    "maxSpeedMph": 20,
    "helmetRequired": "under_16",
    "helmetNotes": "Riders under 16 must wear helmets approved by ANSI or Snell for bicycling or in-line skating.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "prohibited",
    "sidewalkNotes": "Generally not permitted unless deemed necessary due to higher speed limits on adjacent roads. Local jurisdictions may have different rules.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "conditional",
    "streetNotes": "Allowed on roads, bike lanes, and shoulders, except for expressways and roads with speed limits exceeding 50 mph (may be lower in specific cities, e.g., Baltimore imposes a 30 mph limit).",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "Maryland legally defines 'electric low speed scooter' as a vehicle designed to transport only the operator, weighing less than 100 pounds, with single wheels in tandem or a combination of front and rear wheels, equipped with handlebars and a standing platform, powered by electric motor and human power, and capable of speeds up to 20 mph (§11-117.2). Electric scooters must be equipped with a bell, but sirens and whistles are not permitted. A white front light and rear red light or reflector are required for night riding. No insurance, registration, or titles are needed.",
    "sourceLink": "https://mgaleg.maryland.gov/mgawebsite/laws/StatuteText?article=gtr&section=11-117.2",
    "lastVerified": "2025-04-23"
  },
  "MA": {
    "id": "MA",
    "name": "Massachusetts",
    "classification": "specific_escooter",
    "summary": "Massachusetts categorizes electric scooters as 'motorized scooters,' requiring riders to be at least 16 years old with a valid driver's license or learner's permit. Helmets are mandatory for all riders, passenger transport is prohibited, and operation is forbidden at night (sunset to sunrise).",
    "minAge": 16,
    "maxSpeedMph": 20,
    "helmetRequired": "all",
    "helmetNotes": "All riders, regardless of age, must wear protective headgear that meets minimum standards prescribed by the registrar.",
    "licenseRequired": true,
    "registrationRequired": false,
    "sidewalkRiding": null,
    "sidewalkNotes": "State law does not specifically address sidewalk riding, though local ordinances may have restrictions.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "conditional",
    "streetNotes": "Allowed on most public ways but prohibited on limited-access or express state highways where signs specifically prohibit scooters or bicycles. Operators must keep to the right side of the road at all times, including when passing motor vehicles.",
    "lightsRequired": null,
    "brakesRequired": null,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Operation is prohibited at night (from sunset to sunrise). Scooters must be equipped with operational stop and turn signals so operators can keep both hands on the handlebars. Carrying passengers is explicitly prohibited. Motorized scooters are not registered by the Massachusetts Registry of Motor Vehicles as they are not classified as motor vehicles. Violations are punishable by fines: up to $25 for first offense, $25-$50 for second, and $50-$100 for third or subsequent violations.",
    "sourceLink": "https://malegislature.gov/Laws/GeneralLaws/PartI/TitleXIV/Chapter90/Section1e",
    "lastVerified": "2025-04-23"
  },
  "MI": {
    "id": "MI",
    "name": "Michigan",
    "classification": "specific_escooter",
    "summary": "Michigan legally recognizes electric scooters, grouping them with electric skateboards. Riders under 12 can't operate on public roads, and those under 19 must wear helmets. Scooters must not exceed 25 mph or 2,500 watts, and can operate on roadways, bicycle paths, and sidewalks, but not on roads with speed limits above 45 mph except when crossing.",
    "minAge": 12,
    "maxSpeedMph": 25,
    "helmetRequired": "under_18",
    "helmetNotes": "Crash helmets are mandatory for electric scooter riders under 19 years of age.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "allowed",
    "sidewalkNotes": "Permitted on sidewalks, but riders must yield right-of-way to pedestrians and give audible signals before passing.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "conditional",
    "streetNotes": "Allowed on roads with speed limits up to 45 mph. Must ride as near to the right side of the roadway as practicable.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": null,
    "maxPowerWatts": 2500,
    "maxWeightLbs": null,
    "generalNotes": "Electric scooters in Michigan must have a deck no larger than 60 inches long and 18 inches wide and be designed to transport only one person. They must be equipped with brakes, a white front lamp, and a rear red reflector. Not considered 'motor vehicles' under Michigan law, thus exempt from insurance and registration requirements. Local governments may regulate or prohibit operation in specific areas, including downtown districts, waterfront areas, or trails. Operation is prohibited in special charter cities and state parks under the jurisdiction of the Mackinac Island State Park commission.",
    "sourceLink": "https://www.legislature.mi.gov/Laws/MCL?objectName=MCL-257-13F",
    "lastVerified": "2025-04-23"
  },
  "MN": {
    "id": "MN",
    "name": "Minnesota",
    "classification": "specific_escooter",
    "summary": "Minnesota defines electric scooters as 'motorized foot scooters' that must have wheels smaller than 12 inches in diameter and not exceed 15 mph. Riders must be at least 12 years old, with those under 18 required to wear helmets. Scooters are allowed on roadways, bicycle paths, and trails, but generally prohibited on sidewalks.",
    "minAge": 12,
    "maxSpeedMph": 15,
    "helmetRequired": "under_18",
    "helmetNotes": "Riders under 18 years of age must wear properly fitted protective headgear.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "prohibited",
    "sidewalkNotes": "Generally prohibited, except when accessing adjacent properties or when permitted by local regulations.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Allowed on roadways, bicycle paths, and trails, similar to bicycles.",
    "lightsRequired": "night",
    "brakesRequired": null,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Minnesota statutory definition (169.011, subd. 46) describes a 'motorized foot scooter' as a device with handlebars designed to be stood or sat upon by the operator, powered by an internal combustion engine or electric motor capable of propelling the device with or without human propulsion. It must have no more than two 12-inch or smaller diameter wheels and an engine or motor that can reach a maximum speed of 15 mph on a flat surface with not more than one percent grade. Scooters are designed to carry only one person, and aren't classified as motor vehicles, thus exempting them from insurance and registration requirements.",
    "sourceLink": "https://www.revisor.mn.gov/statutes/cite/169.011#stat.169.011.46",
    "lastVerified": "2025-04-23"
  },
  "MS": {
    "id": "MS",
    "name": "Mississippi",
    "classification": "local_rule",
    "summary": "Mississippi lacks statewide electric scooter legislation after bills HB1410 and SB2701 failed to pass in 2020. The state DMV classifies e-scooters as 'Toy Vehicles' that cannot be titled or registered for public roadways. However, cities can establish their own regulations through special legislative approval, as Vicksburg did in becoming the first Mississippi city to allow and regulate e-scooters.",
    "minAge": null,
    "maxSpeedMph": 15,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide helmet requirement exists; regulations are determined by local jurisdictions.",
    "licenseRequired": null,
    "registrationRequired": null,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Varies by locality. For example, Vicksburg explicitly prohibits riding on sidewalks with fines up to $1,000.",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "local_rule",
    "streetNotes": "Where allowed by local ordinance. In Vicksburg, scooters are permitted on streets with speed limits up to 35 mph.",
    "lightsRequired": null,
    "brakesRequired": null,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "While state legislation failed in 2020, Vicksburg obtained special legislative approval to become the first Mississippi city with e-scooters, launching a pilot program with Blue Duck in September 2020 and later approving Bird Rides in 2022. Cities seeking to allow e-scooters may need to pursue similar special legislative approval to establish local regulations.",
    "sourceLink": "https://www.vicksburgpost.com/2020/09/04/electric-scooters-are-set-to-roll-out-in-downtown-vicksburg/",
    "lastVerified": "2025-04-24"
  },
  "MO": {
      "id": "MO",
      "name": "Missouri",
      "classification": "specific_escooter",
      "summary": "Missouri classifies electric scooters as 'motorized bicycles' and requires riders to be at least 16 years old with a valid driver's license. Scooters must have motors rated at less than 2237.1 watts (3 horsepower) and cannot exceed 30 mph, otherwise they may be regulated as motorcycles.",
      "minAge": 16,
      "maxSpeedMph": 30,
      "helmetRequired": "local_rule",
      "helmetNotes": "State law doesn't mandate helmet use for electric scooter riders, but many local jurisdictions make it compulsory.",
      "licenseRequired": true,
      "registrationRequired": false,
      "sidewalkRiding": "prohibited",
      "sidewalkNotes": "Electric scooters cannot be operated on sidewalks according to state law.",
      "bikeLaneRiding": "allowed",
      "streetRiding": "allowed",
      "streetNotes": "Electric scooters can be operated on public streets and highways but are prohibited on the interstate highway system.",
      "lightsRequired": "night",
      "brakesRequired": true,
      "duiApplies": true,
      "maxPowerWatts": 2237,
      "maxWeightLbs": null,
      "generalNotes": "Missouri law classifies electric scooters as 'motorized bicycles' under section 307.180, which defines them as two- or three-wheeled devices with automatic transmission and motors not exceeding 50cc, producing less than 3 gross brake horsepower (approximately 2237.1 watts), and capable of speeds up to 30 mph. Insurance requirements may vary by local jurisdiction, with cities like Springfield requiring scooter operators to have insurance. Scooters must be equipped with adequate lighting and reflectors for night use, a braking system, and an audible signaling device.",
      "sourceLink": "https://revisor.mo.gov/main/OneSection.aspx?section=307.180",
      "lastVerified": "2025-04-24"
  },
  "MO": {
    "id": "MO",
    "name": "Missouri",
    "classification": "specific_escooter",
    "summary": "Missouri classifies electric scooters as 'motorized bicycles' under section 301.010. Riders must be at least 16 years old with a valid driver's license. Scooters must have motors not exceeding 50cc (less than 3 gross brake horsepower/2237.1 watts) and cannot exceed 30 mph, otherwise they may be regulated as motorcycles.",
    "minAge": 16,
    "maxSpeedMph": 30,
    "helmetRequired": "local_rule",
    "helmetNotes": "State law doesn't mandate helmet use for electric scooter riders, but many local jurisdictions make it compulsory.",
    "licenseRequired": true,
    "registrationRequired": false,
    "sidewalkRiding": "prohibited",
    "sidewalkNotes": "Electric scooters cannot be operated on sidewalks according to state law.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Electric scooters can be operated on public streets and highways but are prohibited on the interstate highway system.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": 2237,
    "maxWeightLbs": null,
    "generalNotes": "Missouri statute 301.010(39) legally defines 'motorized bicycle' as 'any two-wheeled or three-wheeled device having an automatic transmission and a motor with a cylinder capacity of not more than fifty cubic centimeters, which produces less than three gross brake horsepower, and is capable of propelling the device at a maximum speed of not more than thirty miles per hour on level ground'. Under section 307.180, this classification applies to electric scooters. Insurance requirements may vary by local jurisdiction. Scooters must be equipped with adequate lighting and reflectors for night use, a braking system, and an audible signaling device.",
    "sourceLink": "https://revisor.mo.gov/main/OneSection.aspx?section=307.180",
    "lastVerified": "2025-04-24"
  },
  "MT": {
    "id": "MT",
    "name": "Montana",
    "classification": "specific_escooter",
    "summary": "Montana classifies electric scooters as 'motorized nonstandard vehicles' under section 61-1-101(47). These vehicles are characterized by having a wheelbase less than 40 inches, wheel diameter under 10 inches, and lacking a manufacturer's certification or VIN. Due to their classification, they cannot be registered with the DMV for use on public roadways, unless authorized by specific city ordinances.",
    "minAge": null,
    "maxSpeedMph": null,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide helmet requirement exists; regulations are determined by local jurisdictions.",
    "licenseRequired": null,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "No statewide regulations; individual cities determine where scooters may be operated.",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "prohibited",
    "streetNotes": "Generally prohibited on public roadways as they cannot be registered with the Montana DMV. Cities may create exceptions through local ordinances.",
    "lightsRequired": null,
    "brakesRequired": null,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Montana statute 61-1-101(47) defines a 'motorized nonstandard vehicle' as a vehicle propelled by its own power using an internal combustion engine or electric motor, with a wheelbase less than 40 inches and wheel diameter less than 10 inches, that doesn't display manufacturer's certification or have a proper VIN. This classification includes electric scooters as well as motorized skateboards. Montana doesn't have a specific statutory framework for electric scooters at the state level, leaving regulation primarily to cities.",
    "sourceLink": "https://archive.legmt.gov/bills/mca/title_0610/chapter_0010/part_0010/section_0010/0610-0010-0010-0010.html",
    "lastVerified": "2025-04-24"
  },
  "NE": {
    "id": "NE",
    "name": "Nebraska",
    "classification": "unclear_or_local",
    "summary": "Nebraska has minimal statewide regulations for electric scooters, with the Department of Motor Vehicles explicitly exempting them from registration requirements. Regulatory authority is largely delegated to individual cities, with municipalities like Omaha and Lincoln implementing their own pilot programs and local ordinances.",
    "minAge": 18,
    "maxSpeedMph": null,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide helmet requirement exists; helmet regulations are determined at the local level by individual cities.",
    "licenseRequired": null,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Most local ordinances prohibit riding on sidewalks, but regulations vary by city.",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "local_rule",
    "streetNotes": "Generally permitted on roads with speed limits up to 35 mph, though specific regulations vary by municipality.",
    "lightsRequired": null,
    "brakesRequired": null,
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Nebraska explicitly categorizes electric scooters among vehicles exempt from registration requirements, along with other off-road vehicles such as ATVs, UTVs, and electric personal assistive devices. The state has minimal statewide legislation specific to e-scooters, with municipal governments taking the lead in creating local regulations. Cities like Omaha and Lincoln have implemented pilot programs that typically establish a minimum rider age of 18, allow use on roads and bicycle paths, prohibit sidewalk riding, and restrict operation to streets with speed limits under 35 mph.",
    "sourceLink": "https://dmv.nebraska.gov/dvr/reg/motor-vehicles-exempt-registration",
    "lastVerified": "2025-04-24"
  },
  "NV": {
    "id": "NV",
    "name": "Nevada",
    "classification": "specific_escooter",
    "summary": "Nevada regulates electric scooters similarly to bicycles and e-bikes under NRS 484B.785. They are generally limited to 15 MPH operation on roadways, bike lanes, paths, and sidewalks (unless local ordinances set lower sidewalk speeds). No statewide license or helmet requirement exists, and they are exempt from registration/insurance. Local authorities can impose further rules.",
    "minAge": null,
    "maxSpeedMph": 15,
    "helmetRequired": "none",
    "helmetNotes": "No statewide helmet requirement.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "allowed",
    "sidewalkNotes": "Permitted on sidewalks and pedestrian areas, but speed must not exceed locally set limits (NRS 484B.785(1)(b)).",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Permitted on roadways at speeds not exceeding 15 mph. Operators have the same rights and duties as bicyclists/e-bicyclists (NRS 484B.785).",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "Regulated under NRS 484B.785, granting operators the rights and duties of bicyclists/e-bicyclists. Max operational speed generally 15 MPH. Max weight 100 lbs (per third-party sources, statute does not specify). Exempt from registration/insurance. Requires lights/reflectors for night use and reliable brakes (implied via bicycle laws). Local authorities may regulate further (NRS 484A.469), potentially including age limits (a minimum age of 16 may apply specifically to shared scooters based on third-party info). DUI laws likely apply as operators share duties with bicyclists.",
    "sourceLink": "https://www.leg.state.nv.us/nrs/NRS-484B.html",
    "lastVerified": "2025-04-24"
  },
  "NH": {
    "id": "NH",
    "name": "New Hampshire",
    "classification": "local_rule",
    "summary": "New Hampshire lacks specific statewide laws for electric scooters, as they are not defined under state motor vehicle statutes. Regulation is primarily handled by local cities and counties. For example, Manchester requires riders to be 16+, register locally ($5 fee), and allows riding on streets and sidewalks, requiring lights and brakes.",
    "minAge": null,
    "maxSpeedMph": null,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide helmet requirement. Local ordinances may impose rules (e.g., Manchester does not require helmets).",
    "licenseRequired": false,
    "registrationRequired": "local_rule",
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Regulation varies by locality. Some cities (e.g., Manchester) permit sidewalk riding, usually requiring yielding to pedestrians.",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "local_rule",
    "streetNotes": "Regulation varies by locality. Some cities (e.g., Manchester) permit riding on public streets, highways, and alleys, requiring adherence to traffic laws.",
    "lightsRequired": "local_rule",
    "brakesRequired": "local_rule",
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "No statewide definition or regulation for electric scooters exists in NH RSA. They are generally not considered motor vehicles under state law, placing regulatory authority with local jurisdictions. Manchester ordinance Ch. 78 serves as an example: requires riders to be 16+, mandates local registration with Police Dept ($5 fee), allows operation on streets/sidewalks (following traffic laws), and requires lights (night) and brakes. Driver's license is not required. Helmet use is not mandated in Manchester.",
    "lastVerified": "2025-04-24"
  },
  "NJ": {
    "id": "NJ",
    "name": "New Jersey",
    "classification": "specific_escooter",
    "summary": "New Jersey legalized 'low speed electric scooters' in 2019 (N.J. Stat. § 39:4-14.16), regulating them like bicycles. Max speed is 19 mph, helmets are required for riders under 17, and no license, registration, or insurance is needed. Operation is allowed on streets and bike paths, while sidewalk riding is subject to local rules.",
    "minAge": null,
    "maxSpeedMph": 19,
    "helmetRequired": "under_17",
    "helmetNotes": "Required for riders under 17 per N.J.S.A. 39:4-10.1 (applicable via N.J.S.A. 39:4-14.16g). Must meet ANSI/Snell standards.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Parking permitted if not impeding traffic (N.J.S.A. 39:4-14.16a). Operation legality on sidewalks determined by local ordinance.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Permitted on streets, highways, and roadways (N.J.S.A. 39:4-14.16a). Max speed 19 MPH. Subject to general bicycle rules.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Defined as 'Low-speed electric scooter' in N.J.S.A. 39:1-1 with max speed < 19 mph. Governed by N.J.S.A. 39:4-14.16, which applies general bicycle laws (N.J.S.A. 39:4). Equipment requirements (bell, lights/reflectors for night, brakes) derived from applicable bicycle statutes (e.g., N.J.S.A. 39:4-10, 39:4-11.1). DUI laws (N.J.S.A. 39:4-50) apply as scooters fall under bicycle regulations, and bicycles are considered vehicles.",
    "sourceLink": "https://law.justia.com/codes/new-jersey/2022/title-39/section-39-4-14-16/",
    "lastVerified": "2025-04-24"
  },
  "NM": {
    "id": "NM",
    "name": "New Mexico",
    "classification": "local_rule",
    "summary": "New Mexico lacks specific statewide laws governing electric scooters. Regulation is handled by local municipalities. House Bill 282 (introduced in 2019 but not passed) sought to define 'electric foot scooters' (<100 lbs, max 20 mph), exempt them from registration, and regulate them similarly to bicycles, but this framework was not adopted statewide.",
    "minAge": null,
    "maxSpeedMph": null,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide requirement; determined by local ordinances.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "State law is silent; regulated by local ordinances. HB 282 (failed) proposed allowing parking if not impeding traffic.",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "local_rule",
    "streetNotes": "State law is silent; regulated by local ordinances. HB 282 (failed) proposed operation similar to bicycles.",
    "lightsRequired": "local_rule",
    "brakesRequired": "local_rule",
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Currently, electric scooter regulations fall under local jurisdiction as New Mexico has no specific statewide statutes. HB 282 (2019, failed) proposed defining them as devices < 100 lbs, max 20 mph, powered solely by electric motor. It also proposed exempting them from vehicle/motor vehicle definitions, registration, and mandatory insurance, while applying bicycle rights, duties, and equipment requirements (lights, bell, brakes per §66-3-707). Parking on sidewalks (if not impeding) was also proposed. Since the bill failed, actual rules depend entirely on local city/county ordinances.",
    "sourceLink": "https://www.nmlegis.gov/Sessions/19%20Regular/bills/house/HB0282.html",
    "lastVerified": "2025-04-24"
  },
  "NY": {
    "id": "NY",
    "name": "New York",
    "classification": "specific_escooter",
    "summary": "New York legalized electric scooters in 2020, regulating them similarly to bicycles under NYS Vehicle & Traffic Law. Minimum rider age is 16, helmets are required under 18, and maximum operational speed is 15 mph (design limit 20 mph). Allowed on roads <= 30 mph. No license, registration, or insurance needed. Local laws can add restrictions.",
    "minAge": 16,
    "maxSpeedMph": 15,
    "helmetRequired": "under_18",
    "helmetNotes": "Required for riders aged 16 and 17. Also required for delivery workers. Recommended for all.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Prohibited statewide unless explicitly authorized by local law or ordinance.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "conditional",
    "streetNotes": "Permitted on highways with a posted speed limit of 30 MPH or less. Municipalities can further regulate time, place, and manner.",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "Defined as 'Electric scooter' (VTL §114-e) with max design speed 20 mph, but illegal to operate > 15 mph. Riders have same rights/duties as bicyclists (VTL Art. 34-D). Requires reliable brakes, bell, front white light and rear red light (night), and manufacturer label. Must weigh < 100 lbs (per third-party source). Exempt from registration/insurance. Cities/towns have authority to regulate further or prohibit use.",
    "sourceLink": "https://www.nysenate.gov/legislation/laws/VAT/114-E",
    "lastVerified": "2025-04-24"
  },
  "ND": {
    "id": "ND",
    "name": "North Dakota",
    "classification": "local_rule",
    "summary": "North Dakota lacks statewide electric scooter laws, delegating regulation to cities like Bismarck, Minot, and Grand Forks. Local ordinances typically set age limits (12-14+), require helmets under 18, limit speed to 15 mph, specify allowed riding areas (roads, paths, sometimes sidewalks), and mandate brakes/lights. Scooters are generally not registered as motor vehicles.",
    "minAge": null,
    "maxSpeedMph": null,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide requirement. Most cities with regulations mandate helmets for riders under 18.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Allowed in some cities, potentially with restrictions. Depends on local ordinances.",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "local_rule",
    "streetNotes": "Generally allowed on streets per local rules, but often prohibited on streets with speed limits above a certain threshold (e.g., 25 mph).",
    "lightsRequired": "local_rule",
    "brakesRequired": "local_rule",
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "North Dakota does not have specific statewide statutes for electric scooters. Regulation is handled at the municipal level. Common local rules (e.g., Bismarck, Minot, Grand Forks) include minimum ages (12-14, often 18 for rentals), helmet requirement for minors (<18), max speed of 15 mph, and requirements for brakes, headlights, and taillights. Scooters are typically distinguished from mopeds and not subject to state vehicle registration.",
    "sourceLink": null,
    "lastVerified": "2025-04-24"
  },
  "NC": {
    "id": "NC",
    "name": "North Carolina",
    "classification": "local_rule",
    "summary": "North Carolina lacks specific statewide laws for electric scooters, leading to a legal gray area. Regulation falls to local municipalities. A 2019 bill (SB 620) proposed defining and regulating them similarly to bicycles (max 20 mph, exempt from registration/license) but did not pass into the main statutes. Moped laws (age 16, helmet) are sometimes incorrectly applied.",
    "minAge": null,
    "maxSpeedMph": null,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide requirement. Moped helmet laws do not apply as e-scooters are not legally classified as mopeds. Local rules vary.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "No statewide regulation; determined by local ordinances.",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "local_rule",
    "streetNotes": "No statewide regulation; determined by local ordinances. Cities like Raleigh, Charlotte, etc., have specific rules.",
    "lightsRequired": "local_rule",
    "brakesRequired": "local_rule",
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Electric scooters are not explicitly defined or regulated in North Carolina General Statutes (e.g., G.S. 20-4.01). SB 620 (2019) proposed definitions (max 20 mph, <12\" wheels) and regulations similar to bicycles, including exemption from motor vehicle/moped status, registration, and insurance, but these provisions were not enacted into the primary vehicle code. Consequently, regulation is inconsistent and handled locally. While sometimes compared to mopeds (requiring age 16+ and helmet), this classification is inaccurate and problematic for registration/insurance. High-power scooters (>20mph) exist in a further gray area, sometimes treated operationally like motorcycles but unable to be registered.",
    "sourceLink": "https://www.ncleg.gov/BillLookUp/2019/S620",
    "lastVerified": "2025-04-24"
  },
  "OH": {
    "id": "OH",
    "name": "Ohio",
    "classification": "specific_escooter",
    "summary": "Ohio defines electric scooters as 'low-speed micromobility devices' (<100 lbs, max 20 mph) under ORC 4511.01. Operation is allowed on streets, sidewalks, paths, and bike lanes, regulated similarly to bicycles (ORC 4511.515). A minimum age of 16 applies only for rentals. Lights are required. No statewide helmet, license, or registration needed. Local rules can add restrictions.",
    "minAge": null,
    "maxSpeedMph": 20,
    "helmetRequired": "none",
    "helmetNotes": "No statewide requirement for helmet use.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "allowed",
    "sidewalkNotes": "Permitted statewide, but must not impede pedestrian traffic (ORC 4511.515(D)). Local authorities can restrict further (ORC 4511.711).",
    "bikeLaneRiding": "allowed",
    "streetRiding": "allowed",
    "streetNotes": "Permitted on public streets and highways. Operators have the same rights and duties as bicyclists (ORC 4511.515(B)).",
    "lightsRequired": "always",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "Defined as 'low-speed micromobility device' (<100 lbs, max 20 mph) under ORC 4511.01(VVV). Regulated by ORC 4511.515, granting bicycle rights/duties. Allowed on streets, sidewalks (not impeding pedestrians), paths, bike lanes. Minimum age 16 *for rentals only*. Lights required (front white, rear red light/reflector) per ORC 4511.515(G). No statewide helmet, license, or registration. Brakes required (via bicycle rules). DUI laws apply (via bicycle rules). Local authorities can impose further restrictions (ORC 4511.711).",
    "sourceLink": "https://codes.ohio.gov/ohio-revised-code/section-4511.01",
    "lastVerified": "2025-04-24"
  },
  "OK": {
    "id": "OK",
    "name": "Oklahoma",
    "classification": "specific_escooter",
    "summary": "Oklahoma classifies electric scooters under the broader category of 'Motorized scooters' (§ 1-133.3). Minimum rider age is 14 (or higher locally), max operational speed is 25 mph, and they cannot be used on roads with speed limits > 25 mph (§ 11-1117). No state license, registration, or insurance required. Local governments have broad regulatory authority.",
    "minAge": 14,
    "maxSpeedMph": 25,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide helmet requirement. Local ordinances may require helmets, often for riders under 18.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Usage on sidewalks is subject to regulation by local municipalities (§ 1-133.3 D).",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "conditional",
    "streetNotes": "Permitted on public roadways, but prohibited on streets with posted speed limits greater than 25 mph. Scooter operational speed cannot exceed 25 mph (§ 11-1117).",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Defined as 'Motorized scooter' (47 Okl. St. Ann. § 1-133.3), covering devices with <=3 wheels, handlebars, foot support/seat, and max design speed <=35 mph (electric or <50cc gas). State sets min age 14, max operational speed 25 mph (§ 11-1117), and exempts from registration/insurance/license requirements, but explicitly grants municipalities broad authority (§ 1-133.3 D) to regulate usage (including age, speed, location, license, insurance). Operators must follow traffic regulations (§ 1-133.3 C.3), implying DUI laws apply and equipment like lights/brakes are needed per general vehicle/bicycle rules.",
    "sourceLink": "https://govt.westlaw.com/okjc/Document/N41FA8040227411ED89B8BED60A034ABF",
    "lastVerified": "2025-04-24"
  },
  "OR": {
    "id": "OR",
    "name": "Oregon",
    "classification": "specific_escooter",
    "summary": "Oregon defines electric scooters as 'Motor assisted scooters' (ORS 801.348). Riders must be 16+, helmets are mandatory for all, and max operational speed is 15 mph (design limit 24 mph, 1000W). Permitted on bike lanes and roads <= 25 mph. Sidewalk riding prohibited. No license, registration, or insurance needed.",
    "minAge": 16,
    "maxSpeedMph": 15,
    "helmetRequired": "all",
    "helmetNotes": "Protective headgear meeting federal standards is required for all operators on highways or premises open to the public (ORS 814.560).",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "prohibited",
    "sidewalkNotes": "Operation on sidewalks is prohibited (ORS 814.558).",
    "bikeLaneRiding": "allowed",
    "streetRiding": "conditional",
    "streetNotes": "Permitted on roadways. Operation on highways with speed limits > 25 mph is prohibited unless there is a bicycle lane (ORS 814.552(1)). Maximum operational speed is 15 mph (ORS 814.552(3)).",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": 1000,
    "maxWeightLbs": null,
    "generalNotes": "Defined as 'Motor assisted scooter' (ORS 801.348): <=4 wheels, foot support/seat, motor/human propulsion, max design speed 24 mph, motor <= 1000W (electric) or <=35cc (gas). Regulated under ORS 814.550 - 814.562, granting bicycle rights/duties (ORS 814.550). Minimum age 16 (ORS 814.554). Helmet required (ORS 814.560). Max operational speed 15 mph (ORS 814.552). Lights required sunset-sunrise (ORS 814.556 applies ORS 815.280). Brakes required (via bicycle rules). Exempt from registration/insurance/license. DUI laws apply (ORS 813).",
    "sourceLink": "https://oregon.public.law/statutes/ors_801.348",
    "lastVerified": "2025-04-24"
  },
  "PA": {
    "id": "PA",
    "name": "Pennsylvania",
    "classification": "prohibited",
    "summary": "Pennsylvania lacks statewide law enabling e-scooters on public roads due to PennDOT's interpretation requiring registration/insurance, which isn't possible. Proposed legislation (SB 892/HB 2218) aims to define 'Electric Low Speed Scooters' (<100 lbs, 15 mph, age 18+, bike rules) and allow local regulation. Currently, use is effectively limited to private property, though Pittsburgh ran a pilot program (seeking renewal) while Philadelphia bans them, highlighting local control/variance.",
    "minAge": null,
    "maxSpeedMph": null,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide requirement. Local rules or pilot programs (like Pittsburgh's) may impose requirements.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "State law/PennDOT effectively prohibits road use, making sidewalk rules moot statewide. Proposed legislation (HB 2218) restricts sidewalk use in business districts. Local programs or bans dictate rules.",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "local_rule",
    "streetNotes": "Currently prohibited on public roadways per PennDOT interpretation (lack of registration/title). Proposed legislation would allow operation on roads <= 35 mph. Local pilot programs (e.g., Pittsburgh) may create exceptions.",
    "lightsRequired": "local_rule",
    "brakesRequired": "local_rule",
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Pennsylvania currently lacks statewide authorization for e-scooters on public roads. PennDOT requires vehicles on roadways to be titled, registered, and insured, which is not possible for e-scooters. Proposed legislation (SB 892 / HB 2218) would define 'Electric Low Speed Scooters' (<100 lbs, max 15 mph), set minimum age to 18, apply bicycle duties, require lights, and allow local municipalities to regulate use (permitting on roads <=35 mph, bike lanes/paths, but potentially prohibiting on sidewalks in business districts). This legislation has not been enacted as of late 2024. Pittsburgh ran a pilot program (July 2021-April 2023) under specific authorization, and legislation (HB 2218) seeks its renewal. Philadelphia bans e-scooters. Use remains restricted to private property unless part of a locally authorized program.",
    "sourceLink": "https://www.legis.state.pa.us/cfdocs/legis/PN/Public/btCheck.cfm?txtType=PDF&sessYr=2023&sessInd=0&billBody=H&billTyp=B&billNbr=2218&pn=3729",
    "lastVerified": "2025-04-24"
  },
  "TX": {
    "id": "TX",
    "name": "Texas",
    "classification": "specific_escooter",
    "summary": "Texas law classifies electric scooters as motor-assisted scooters under Transportation Code §551.351, allowing operation on roads with speed limits ≤35 MPH. No statewide license, registration, or helmet requirements for adults, though local governments retain regulatory authority over operation zones and parking.",
    "minAge": 16,
    "maxSpeedMph": null,
    "helmetRequired": "none",
    "helmetNotes": "State law does not mandate helmets, but local ordinances like Dallas require helmets for riders under 18.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "conditional",
    "sidewalkNotes": "Generally permitted statewide unless prohibited by local ordinance. Dallas prohibits sidewalk riding.",
    "bikeLaneRiding": "allowed",
    "streetRiding": "conditional",
    "streetNotes": "Permitted on streets with posted speed limits ≤35 MPH. Prohibited on highways and roads exceeding 35 MPH without local authorization.",
    "lightsRequired": null,
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Defined as motor-assisted scooters with ≤40cc engine or equivalent electric motor, braking system, and standing platform. Operators have same rights/duties as bicyclists except where impractical. Local governments may impose additional restrictions on operation zones and parking.",
    "sourceLink": "https://statutes.capitol.texas.gov/docs/tn/htm/tn.551.htm",
    "lastVerified": "2025-04-23"
  },
  "WV": {
    "id": "WV",
    "name": "West Virginia",
    "classification": "local_rule",
    "summary": "West Virginia lacks statewide e-scooter laws; regulation is entirely local. Cities like Charleston (age 16+, 25 mph max) and Wheeling (age 18+, 25 mph max, no sidewalk) set their own rules. No state age, speed, helmet, license, or registration requirements exist.",
    "minAge": null,
    "maxSpeedMph": null,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide mandate. Rules vary by city ordinance.",
    "licenseRequired": null,
    "registrationRequired": null,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "Determined by local ordinance; prohibited in some cities (e.g., Wheeling).",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "local_rule",
    "streetNotes": "Allowed per local rules, often with restrictions based on road speed limits (e.g., prohibited >30 mph in Charleston).",
    "lightsRequired": "local_rule",
    "brakesRequired": "local_rule",
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "West Virginia has no specific state statutes defining or regulating electric scooters. They are not explicitly classified, though sometimes ambiguously linked to 'play vehicles'. All regulations (age, speed, helmets, operating areas) are determined by individual city/town ordinances. E-bike laws (e.g., WV Code §17C-11-8) do not apply to electric scooters.",
    "sourceLink": "https://code.wvlegislature.gov/17C-11-8/",
    "lastVerified": "2025-04-24"
  },
  "WI": {
    "id": "WI",
    "name": "Wisconsin",
    "classification": "specific_escooter",
    "summary": "Wisconsin defines 'Electric scooters' (<100 lbs, max 20 mph design) and regulates them like bicycles. Statewide operational speed limit is 15 mph. No state age, license, or helmet rules. Sidewalks allowed unless locally banned. Road use limited (max 35 mph, <=25 mph general, requires bike lane if >25 mph). Needs lights/brakes. No registration. DUI applies.",
    "minAge": null,
    "maxSpeedMph": 15,
    "helmetRequired": "none",
    "helmetNotes": "No statewide helmet requirement.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "allowed",
    "sidewalkNotes": "Permitted unless specifically prohibited by local ordinance (Statute 346.804(3)).",
    "bikeLaneRiding": "allowed",
    "streetRiding": "conditional",
    "streetNotes": "Permitted on roads with speed limits <= 25 mph. On roads > 25 mph, allowed only if there is a bicycle lane and operation is within that lane. Prohibited on roads with speed limits > 35 mph (Statute 346.804(4)).",
    "lightsRequired": "night",
    "brakesRequired": true,
    "duiApplies": true,
    "maxPowerWatts": null,
    "maxWeightLbs": 100,
    "generalNotes": "Defined as 'Electric scooter' weighing < 100 lbs, max design speed 20 mph (Statute 340.01(15ps)). Max operational speed statewide is 15 mph (Statute 346.804(5)). Treated like bicycles regarding rights/duties (Statute 346.804(1)). Requires front white light and rear red reflector/light during darkness (Statute 346.804(6)). Brakes required (via bicycle rules 346.77). No sirens/whistles. Exempt from registration/title. Subject to DUI laws (Statute 346.94(2m)). Local authorities may enact further regulations.",
    "sourceLink": "https://docs.legis.wisconsin.gov/document/statutes/346.804",
    "lastVerified": "2025-04-24"
  },
  "WY": {
    "id": "WY",
    "name": "Wyoming",
    "classification": "local_rule",
    "summary": "Wyoming lacks specific statewide laws for electric scooters; regulation is entirely local. The closest state definition is 'motorized skateboard' (W.S. 31-1-101(a)(xxix)), but this lacks operational rules. Cities like Cheyenne, Casper, and Laramie set their own rules (age, speed, helmet, location).",
    "minAge": null,
    "maxSpeedMph": null,
    "helmetRequired": "local_rule",
    "helmetNotes": "No statewide requirement. Local rules vary; helmets often encouraged or required, sometimes specifically for minors.",
    "licenseRequired": false,
    "registrationRequired": false,
    "sidewalkRiding": "local_rule",
    "sidewalkNotes": "State law is silent. Determined by local ordinance; often prohibited in specific areas or entirely.",
    "bikeLaneRiding": "local_rule",
    "streetRiding": "local_rule",
    "streetNotes": "State law is silent. Determined by local ordinance; often allowed on roads with specified speed limits (e.g., ≤ 35 mph).",
    "lightsRequired": "local_rule",
    "brakesRequired": "local_rule",
    "duiApplies": null,
    "maxPowerWatts": null,
    "maxWeightLbs": null,
    "generalNotes": "Wyoming has no specific state statutes defining or regulating electric scooters operationally. The vague 'motorized skateboard' definition exists but offers no guidance. All regulations (age, speed, helmets, operating areas, equipment) are determined by individual city/town ordinances. Wyoming Statute SF0081 (2019) primarily concerns electric *bicycles* and does not apply to electric scooters. Check local city ordinances for specific rules.",
    "sourceLink": null,
    "lastVerified": "2025-04-24"
  }
}